on("ready",function(){ItemDB.loadDB({name:"ItemDB - MonsterLoot Non-SRD (Shaped)",version:2.0,weapons:[{category:"weapons",class:"MARTIAL",name:"Chasme Proboscis",type:"MELEE_WEAPON",weight:2,attack_damage_dice:2,attack_damage_die:"d8",attack_damage_type:"piercing",reach:"5 ft.",attack_ability:"STR",attack_damage_ability:"STR",content:"Used as a War Pick that deals double damage."},{category:"weapons",class:"MARTIAL",name:"Death Slaad Claw",type:"MELEE_WEAPON",weight:4,attack_damage_dice:1,attack_damage_die:"d8",attack_damage_type:"slashing",reach:"5 ft.",attack_ability:"STR",attack_damage_ability:"STR",versatile:!0,attack_second_damage_dice:2,attack_second_damage_die:"d6",attack_second_damage_type:"necrotic",content:"Used as a Battleaxe that deals an additional 2d6 necrotic damage."},{category:"weapons",class:"MARTIAL",name:"Displacer Beast Tentacle",type:"MELEE_WEAPON",weight:3,attack_damage_dice:1,attack_damage_die:"d6",attack_damage_type:"bludgeoning",reach:"10 ft.",attack_ability:"FIN",attack_damage_ability:"FIN",attack_second_damage_dice:1,attack_second_damage_die:"d6",attack_second_damage_type:"piercing",content:"Used as a Whip that deals 1d6 bludgeoning damage and 1d6 piercing damage."},{category:"weapons",class:"MARTIAL",name:"Empyrean Maul",type:"MELEE_WEAPON",weight:10,attack_damage_dice:2,attack_damage_die:"d6",attack_damage_type:"bludgeoning",reach:"5 ft.",attack_ability:"STR",attack_damage_ability:"STR",attack_bonus:2,attack_damage_bonus:2,heavy:!0,two_handed:!0,saving_throw_dc:15,saving_throw_vs_ability:"CONSTITUTION",content:"You gain a +2 bonus to Attack and Damage Rolls made with this Magic Weapon.  If the target is a creature, it must succeed on a DC 15 Constitution saving throw or be stunned until the end of the wielder's next turn. Once per day, the wielder can strike the ground, creating a tremor. All other creatures on the ground within 30 feet of the wielder must succeed on a DC 18 Strength saving throw or be knocked prone."},{category:"weapons",class:"MARTIAL",name:"Grell Tentacle",type:"MELEE_WEAPON",weight:3,attack_damage_dice:1,attack_damage_die:"d10",attack_damage_type:"piercing",reach:"10 ft.",attack_ability:"FIN",attack_damage_ability:"FIN",content:"Used as a Whip that deals 1d10 piercing damage. The target is also grappled (escape DC 15). If the target is Medium or smaller, it is also restrained until this grapple ends. While grappling the target, the wielder has advantage on attack rolls against it and can't use this attack against other targets. When the wielder moves, any Medium or smaller target it is grappling moves with it."},{category:"weapons",class:"MARTIAL",name:"Hook Horror Hook",type:"MELEE_WEAPON",weight:18,attack_damage_dice:2,attack_damage_die:"d6",attack_damage_type:"piercing",reach:"10 ft.",attack_ability:"STR",attack_damage_ability:"STR",heavy:!0,two_handed:!0,content:"Used as a Pike that deals 2d6 damage."},{category:"weapons",class:"SIMPLE",name:"Needle Blight Needle",type:"RANGED_WEAPON",weight:.25,attack_damage_dice:2,attack_damage_die:"d4",attack_damage_type:"piercing",range:"20/60 ft.",attack_ability:"FIN",attack_damage_ability:"FIN",thrown:!0,ammo_field_name:"Needle Blight Needles",content:"Used as a Dart that deals double damage."},{category:"weapons",class:"MARTIAL",name:"Umber Hulk Mandible",type:"MELEE_WEAPON",weight:3,attack_damage_dice:2,attack_damage_die:"d6",attack_damage_type:"slashing",reach:"5 ft.",attack_ability:"FIN",attack_damage_ability:"FIN",light:!0,content:"Used as a Scimitar that deals double damage."},{category:"weapons",class:"SIMPLE",name:"Young Remorhaz Fang",type:"MELEE_WEAPON",weight:1,attack_damage_dice:1,attack_damage_die:"d4",attack_damage_type:"piercing",reach:"5 ft.",range:"20/60 ft.",attack_ability:"FIN",attack_damage_ability:"FIN",thrown:!0,light:!0,ammo_field_name:"Young Remorhaz Fangs",content:"Used as a Dagger."}],ammo:[{category:"ammo",name:"Galeb Duhr Chunk",ammo_field_name:"Galeb Duhr Chunks",attack_bonus:1,attack_damage_bonus:1,content:"Used as a +1 Sling stone."},{category:"ammo",name:"Spined Devil Spine",ammo_field_name:"Spined Devil Spines",attack_second_damage_dice:1,attack_second_damage_die:"d6",attack_second_damage_type:"fire",content:"Used as a Bolt that deals an additional 1d6 fire damage."}],armor_enchantments:[{category:"armor_enchantments",name:"Goristro",ac_bonus:2,content:"*Requires attunement.* This armor grants resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."},{category:"armor_enchantments",name:"Grell",content:"*Requires attunement.* This armor grants resistance to lightning damage and +2 to passive Perception checks."},{category:"armor_enchantments",name:"of Levitation",content:"*Requires attunement.* This armor allows the wearer to use an action to cast the Levitate spell on themselves at will. This property can be used 3 times per day."},{category:"armor_enchantments",name:"of Spell Reflection",content:"*Requires attunement.* If the wearer of this armor makes a successful saving throw against a spell, or a spell attack misses it, they can use a bonus action to choose another creature (including the spellcaster) it can see within 30 feet of it. The spell targets the chosen creature instead of the wearer. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature. This effect can be used once per round."},{category:"armor_enchantments",name:"of the Depths",content:"*Requires attunement.* This armor grants advantage on Dexterity (Stealth) checks made to hide while underground."},{category:"armor_enchantments",name:"Thri-Keen",content:"*Requires attunement.* This armor can change color and texture at will to match the surroundings, giving +5 on Dexterity (Stealth) checks made to hide."}],potions:[{category:"potions",section:"utility",uses:1,name:"Beholder Slime",weight:0,content:"Used as an Oil of Slipperiness."},{category:"potions",section:"utility",uses:1,name:"Potion of Cambion Fire",weight:0,content:"After drinking this potion, you can use a bonus action to use fire ray attack with a 120 ft. range and deals 3d6 fire damage. The effect ends after you exhale the fire three times or when 1 hour has passed. This potion's deep red liquid seems to flare with fire from a depth farther than that of the bottle."},{category:"potions",section:"utility",uses:1,name:"Potion of Jumping",weight:0,content:"After drinking this potion, you can jump twice your normal distance for one hour."},{category:"potions",section:"utility",uses:1,name:"Potion of the Goristro",weight:0,content:"After drinking this potion, you have Resistance to Cold, Fire or Lightning for one hour."}],poisons:[{category:"poisons",section:"utility",uses:1,name:"Chasme Poison",weight:0,attack_damage_dice:7,attack_damage_die:"d6",attack_damage_type:"necrotic",content:"Target takes 24 (7d6) necrotic damage, and their hit point maximum is reduced by an amount equal to the necrotic damage taken. If this effect reduces a creature's hit point maximum to 0, the creature dies. This reduction to a creature's hit point maximum lasts until the creature finishes a long rest or until it is affected by a spell like greater restoration."},{category:"poisons",section:"utility",uses:1,name:"Grell Poison",weight:0,saving_throw_vs_ability:"CONSTITUTION",saving_throw_dc:11,content:"Target must succeed on a DC 11 Constitution saving throw or be poisoned for 1 minute. The poisoned target is paralyzed, and it can repeat the saving throw at the end of each of its turns, ending the effect on a success."}],adv_gear:[{category:"adventuring_gear",name:"Animating Spore Sac",weight:0,section:"utility",uses:1,content:"Can be squeezed at one corpse of a humanoid or a Large or smaller beast within 5 feet and release spores at the corpse. In 24 hours, the corpse rises as a spore servant. The corpse stays animated for 1d4 + 1 weeks or until destroyed, and it can't be animated again in this way. Single use only."},{category:"adventuring_gear",name:"Faerie Dragon Lung",weight:1,section:"utility",uses:1,saving_throw_vs_ability:"WISDOM",saving_throw_dc:11,content:"Can be squeezed at one creature within 5 feet of it. The target must succeed on a DC 11 Wisdom saving throw, or for 1 minute, the target can't take reactions and must roll a d6 at the start of each of its turns to determine its behavior during the turn: 1-4. The target takes no action or bonus action and uses all of its movement to move in a random direction. 5-6. The target doesn't move, and the only thing it can do on its turn is make a DC 11 Wisdom saving throw, ending the effect on itself on a success. One use only."},{category:"adventuring_gear",name:"Gnoll Pack Lord Head",weight:15,content:"Grants advantage on Intimidation checks made against the pack lord's gnoll pack when held or worn outwardly."},{category:"adventuring_gear",name:"Hallucination Spore Sac",weight:0,section:"utility",uses:1,saving_throw_vs_ability:"CONSTITUTION",saving_throw_dc:12,content:"Can be squeezed at one creature you can see within 5 feet of it. The target must succeed on a DC 12 Constitution saving throw or be poisoned for 1 minute. The poisoned target is incapacitated while it hallucinates. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Single use only."},{category:"adventuring_gear",name:"Heart of Hruggek",weight:2,section:"utility",uses:1,content:"When eaten, grants advantage on saving throws against being charmed, frightened, paralyzed, poisoned, stunned, or put to sleep."},{category:"adventuring_gear",name:"Pacifying Spore Sac",weight:0,section:"utility",uses:1,saving_throw_vs_ability:"CONSTITUTION",saving_throw_dc:11,content:"Can be squeezed at one creature you can see within 5 feet of it. The target must succeed on a DC 11 Constitution saving throw or be stunned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Single use only."},{category:"adventuring_gear",name:"Rapport Spore Sac",weight:0,section:"utility",uses:1,content:"Can be squeezed or destroyed to create a 10-foot radius of spores. These spores can go around corners and affect only creatures with an Intelligence of 2 or higher that aren't undead, constructs, or elementals. Affected creatures can communicate telepathically with one another while they are within 30 feet of each other. The effect lasts for 1 hour."},{category:"adventuring_gear",name:"Vine Blight Husk",weight:0,content:"Used as a Cloak that grants advantage to Stealth checks in forested terrain."},{category:"adventuring_gear",name:"Yugoloth Ichor",weight:1,section:"offense",attack_damage_dice:2,attack_damage_die:"d6",attack_damage_type:"acid",attack_damage_ability:"0",range:"20/60 ft.",uses:1,content:"Used as Acid."}],wondrous_items:[{category:"wondrous_items",name:"Aarakocra Scalp",weight:1,recharge:"SHORT_REST",uses:1,content:"5 can be used as a ritual headdress to summon an air elemental. All headdress wearers must be within 30 ft. of each other and perform a ritual dance, maintaining concentration is if concentrating on a spell. On the 3rd turn, the elemental appears within 60 ft. of them, obeys their spoken commands. It remains for 1 hour, until it or all of its summoners die, or until any of its summoners dismissit as a bonus action. The ritual cannot be performed again until after a short rest."},{category:"wondrous_items",name:"Amulet of Psychic Defense",weight:0,content:"*Requires attunement.* The wearer of this amulet can apply their Wisdom modifier to their AC when not wearing armor or carrying a shield."},{category:"wondrous_items",name:"Amulet of the Beholder",weight:0,content:"*Requires attunement.* The wearer of this amulet can cast Antimagic Field once per day."},{category:"wondrous_items",name:"Amulet of the Kuo-Toa",weight:0,content:"*Requires attunement.* The wearer of this amulet can sense the presence of any creature within 30 feet of it that is invisible or on the Ethereal Plane. They can also pinpoint such a creature that is moving. Contact is broken at the will of the wearer or after one hour. Once this property is used, it can't be used again until the next dawn."},{category:"wondrous_items",name:"Amulet of the Yeti",weight:0,content:"*Requires attunement.* This amulet has 3 charges. Using 1 charge, the wearer can target one creature they can see within 30 feet. If the target can see the wearer, the target must succeed on a DC 18 Constitution saving throw against this magic or take 21 (6d6) cold damage and then be paralyzed for 1 minute, unless it is immune to cold damage. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If the target's saving throw is successful, or if the effect ends on it, the target is immune to this gaze for 1 hour. The amulet regains 1d3 charges at dawn."},{category:"wondrous_items",name:"Amulet of the Yochlol",weight:0,content:"*Requires attunement.* The wearer of this amulet can use an action to transform into a toxic mist. Any equipment being worn or carried is also transformed. While in mist form, the wearer is incapacitated and can't speak. They have a flying speed of 30 feet, can hover, and can pass through any space that isn't airtight. They has advantage on Strength, Dexterity, and Constitution saving throws, and are immune to nonmagical damage. While in mist form, the wearer can enter a creature's space and stop there. Each time that creature starts its turn with the wearer in its space, the creature must succeed on a DC 14 Constitution saving throw or be poisoned until the start of its next turn. While poisoned in this way, the target is incapacitated. If the wearer reverts to true form in another creature's space, they take 3d8 force damage. The mist form ends after 10 minutes or as a bonus action. Once used, this feature can't be used again until the next dawn."},{category:"wondrous_items",name:"Cloak of Spell Reflection",weight:0,content:"*Requires attunement.* If the wearer of this cloak makes a successful saving throw against a spell, or a spell attack misses it, they can use a bonus action to choose another creature (including the spellcaster) it can see within 30 feet of it. The spell targets the chosen creature instead of the wearer. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature. This effect can be used once per round."},{category:"wondrous_items",name:"Cloak of the Depths",weight:0,content:"*Requires attunement.* While you wear this cloak, you have advantage on Dexterity (Stealth) checks made to hide while underground."},{category:"wondrous_items",name:"Death Tyrant Central Eye",weight:0,section:"utility",recharge:"LONG_REST",uses:3,content:"Used to emit an invisible, magical 60-foot cone of negative energy. Any creature in that area can't regain hit points. Any humanoid that dies there becomes a zombie under the wielder's command. The dead humanoid retains its place in the initiative order and animates at the start of its next turn, provided that its body hasn't been completely destroyed. This cone remains active for 1 minute or 3 rounds, whichever comes first, or until dismissed. After the effect has ended, roll d20. On a 1 the eye crumbles to dust. The eye has 3 charges. 1d3 charges are regained after a long rest."},{category:"wondrous_items",name:"Eyes of Confusion",weight:0,content:"*Requires attunement.* While wearing these goggles and a creature starts its turn within 30 feet of you and is able to see your eyes, you can use 1 charge to magically force it to make a DC 15 Charisma saving throw. On a failed saving throw, the creature can't take reactions until the start of its next turn and rolls a d8 to determine what it does during that turn. On a 1 to 4, the creature does nothing. On a 5 or 6, the creature takes no action but uses all its movement to move in a random direction. On a 7 or 8, the creature makes one melee attack against a random creature, or it does nothing if no creature is within reach. The Eyes have 3 charges, and regain 1d3 charges at the next dawn."},{category:"wondrous_items",name:"Eyes of Cursing",weight:0,content:"*Requires attunement.* While wearing these goggles, you can use 1 charge to force a creature you can see within 60 feet of you to make a DC 14 Charisma saving throw. The creature takes 27 (6d8) psychic damage on a failed save, or half as much damage on a successful one. Using 2 charges also allows a failed save to curse the creature with magical deformities. While deformed, the creature has its speed halved and has disadvantage on ability checks, saving throws, and attacks based on Strength or Dexterity. The transformed creature can repeat the saving throw whenever it finishes a long rest, ending the effect on a success. The goggles have 3 charges, and regain 1d3 charges at the next dawn."},{category:"wondrous_items",name:"Geode Heart",weight:1,section:"utility",recharge:"LONG_REST",uses:1,content:"Used to animate 1 boulder you can see within 60 ft. The boulder has statistics like those of a galeb duhr, except it has Intelligence 1 and Charisma 1, it can't be charmed or frightened, and can't animate boulders. It obeys simple commands to the best of its ability. A boulder remains animated as long as the wielder maintains concentration, up to 1 minute (as if concentrating on a spell)."},{category:"wondrous_items",name:"Goggles of Rotting",weight:0,content:"*Requires attunement.* While wearing the goggles, you can use one charge to target one creature it can see within 30 feet of it. The target must succeed on a DC 12 Constitution saving throw against this magic or take 10 (3d6) necrotic damage. The goggles have 6 charges, and regain 1d6 charges at dawn."},{category:"wondrous_items",name:"Goggles of Slumber",weight:0,content:"*Requires attunement.* When wearing the goggles, the wearer can gaze at a target within 30 ft. This target must make a DC 10 Wisdom saving throw. On a failed save, the target succumbs to a magical slumber, falling unconscious for 10 minutes or until someone uses an action to shake the target awake. A creature that successfully saves against the effect is immune to this gaze for the next 24 hours. Undead and creatures immune to being charmed aren't affected by it. Once this property is use, it can't be used again until the next dawn."},{category:"wondrous_items",name:"Grell Cloak",weight:0,content:"*Requires attunement.* This cloak grants resistance to lightning damage and +2 to passive Perception checks."},{category:"wondrous_items",name:"Small Beholder Eye",weight:0,section:"utility",recharge:"LONG_REST",uses:1,content:"Casts a random beholder ray on each use. Once used, it can't be used until the next dawn. After 1d3+2 uses, the eyes dissolves and becomes useless."},{category:"wondrous_items",name:"Small Death Tyrant Eye",weight:0,section:"utility",recharge:"LONG_REST",uses:1,content:"Casts a random death tyrant ray on each use. Once used, it can't be used until the next dawn. After 1d3+2 uses, the eyes dissolves and becomes useless."},{category:"wondrous_items",name:"Spectator Eye",weight:0,section:"utility",recharge:"LONG_REST",uses:1,content:"Casts a random spectator ray on each use. Once used, it can't be used until the next dawn. After 1d3+2 uses, the eyes dissolves and becomes useless."}]})});
